src/src/DataProcessors/DiscountTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>DiscountTypes</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/src/Enums/DiscountsApplyingRules.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>DiscountsApplyingRules</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Exclusion</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Minimum</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Max</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Addition</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Multiplication</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Catalogs/AutomaticDiscountTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>AutomaticDiscountTypes</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Acts</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AssignmentMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountValueType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Purpose</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountsArea</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AssignmentArea</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountApplyingArea</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountMarkupValue</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RestrictionByProductsVariant</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountApplyingFilterType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsRestrictionOnRecipientsCounterparties</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsRestrictionByRecipientsWarehouses</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ThereIsSchedule</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalOrderingAttribute</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsClarificationByProducts</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsClarificationByProductsCategories</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsClarificationByPriceGroups</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AssignmentCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SharedUsageVariant</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountsApplyingRules</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ThereAreFoldersToBeClarifiedByProducts</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>TimeByDaysOfWeek</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Selected</Name>
							<Comment>(Common) Shows a selected day of the week</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>WeekDay</Name>
							<Comment>(Common) Day of the week</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.WeekDays</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BeginTime</Name>
							<Comment>(Common) Discount validity start time</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EndTime</Name>
							<Comment>(Common) Discount expiration time</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ProductsGroupsPriceGroups</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ValueClarification</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Products</v8:Type>
								<v8:Type>cfg:CatalogRef.ProductsCategories</v8:Type>
								<v8:Type>cfg:CatalogRef.PriceGroups</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DiscountMarkupValue</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Characteristic</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsCharacteristics</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ConditionsOfAssignment</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>AssignmentCondition</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DiscountConditions</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DiscountRecipientsCounterparties</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Recipient</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DiscountRecipientsWarehouses</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Recipient</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/src/DataProcessors/DiscountTypes/Forms/Form/Ext/Form/Module.bsl
#Region CommonUseProceduresAndFunctions

// Using the procedure you can select or clear the "Active" flag.
//
// Parameters:
//  NewValue  - Boolean - New value of the "Active" flag.
//  SelectedRowArray  - Array - String array selected in the list of automatic discounts.
//
&AtServer
Procedure ChangeCheckBoxActsServer(NewValue, Val SelectedRowArray)

	NeedToUpdateList = False;
	For Each AutoDiscountRow In SelectedRowArray Do
		If AutoDiscountRow.Acts <> NewValue Then
			If AutoDiscountRow.Ref.IsEmpty() Or AutoDiscountRow.IsFolder Then
				Continue;
			EndIf;
			ObjectAutoDiscount = AutoDiscountRow.Ref.GetObject();
			ObjectAutoDiscount.Acts = NewValue;
			Try
				ObjectAutoDiscount.Write();
				NeedToUpdateList = True;
			Except
				Message = New UserMessage;
				Message.Text = NStr("en = 'Cannot change the ""Active"" flag for  ""'")+AutoDiscountRow.Ref+""".";
				Message.Field = "Acts";
				Message.SetData(AutoDiscountRow.Ref);
				Message.Message();
			EndTry;
		EndIf;
	EndDo;
	
	If NeedToUpdateList Then
		Items.AutomaticDiscounts.Refresh();
	EndIf;

EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

// The procedure checks the configured sorting by the
// attribute "AdditionalSortingAttribute" and suggests to set this sorting.
//
&AtClient
Procedure ValidateListFilter()
	
	SortingSetupParameters = New Structure;
	SortingSetupParameters.Insert("ListAttribute", AutomaticDiscounts);
	SortingSetupParameters.Insert("ListItem", Items.AutomaticDiscounts);
	
	If Not SortInListIsSetCorrectly() Then
		QuestionText = NStr("en = 'It is recommended
		                    |to sort the list by the field ""Order"". Configure the necessary sorting?'");
		NotifyDescription = New NotifyDescription("CheckListBeforeOperationResponseForSortingReceived", ThisObject, SortingSetupParameters);
		Buttons = New ValueList;
		Buttons.Add(DialogReturnCode.Yes, NStr("en = 'Customize'"));
		Buttons.Add(DialogReturnCode.No, NStr("en = 'Do not configure'"));
		ShowQueryBox(NotifyDescription, QuestionText, Buttons, , DialogReturnCode.Yes);
		Return;
	EndIf;
	
EndProcedure

// The function checks that the list is sorted by the attribute AdditionalOrderingAttribute.
//
&AtClient
Function SortInListIsSetCorrectly()
	
	UserOrderSettings = Undefined;
	For Each Item In AutomaticDiscounts.SettingsComposer.UserSettings.Items Do
		If TypeOf(Item) = Type("DataCompositionOrder") Then
			UserOrderSettings = Item;
			Break;
		EndIf;
	EndDo;
	
	If UserOrderSettings = Undefined Then
		Return True;
	EndIf;
	
	OrderItems = UserOrderSettings.Items;
	
	// Find the first used order item
	Item = Undefined;
	For Each OrderingItem In OrderItems Do
		If OrderingItem.Use Then
			Item = OrderingItem;
			Break;
		EndIf;
	EndDo;
	
	If Item = Undefined Then
		// No sorting is set
		Return False;
	EndIf;
	
	If TypeOf(Item) = Type("DataCompositionOrderItem") Then
		If Item.OrderType = DataCompositionSortDirection.Asc Then
			AttributeField = New DataCompositionField("AdditionalOrderingAttribute");
			If Item.Field = AttributeField Then
				Return True;
			EndIf;
		EndIf;
	EndIf;
	
	Return False;
	
EndFunction

// The procedure processes user response to the question about the sorting by the attribute AdditionalOrderingAttribute.
//
&AtClient
Procedure CheckListBeforeOperationResponseForSortingReceived(ResponseResult, AdditionalParameters) Export
	
	If ResponseResult <> DialogReturnCode.Yes Then
		Return;
	EndIf;
	
	SetListSortingByFieldOrderAtClient();
	
EndProcedure

// The procedure sets the order by the field AdditionalOrderingAttribute.
//
&AtClient
Procedure SetListSortingByFieldOrderAtClient()
	
	ListAttribute = AutomaticDiscounts;
	
	UserOrderSettings = Undefined;
	For Each Item In ListAttribute.SettingsComposer.UserSettings.Items Do
		If TypeOf(Item) = Type("DataCompositionOrder") Then
			UserOrderSettings = Item;
			Break;
		EndIf;
	EndDo;
	
	CommonUseClientServer.Validate(UserOrderSettings <> Undefined, NStr("en = 'Custom order setup setting was not found.'"));
	
	UserOrderSettings.Items.Clear();
	Item = UserOrderSettings.Items.Add(Type("DataCompositionOrderItem"));
	Item.Use = True;
	Item.Field = New DataCompositionField("AdditionalOrderingAttribute");
	Item.OrderType = DataCompositionSortDirection.Asc;
	
EndProcedure

// The procedure sets the order by the field AdditionalOrderingAttribute.
//
&AtServer
Procedure SetListSortingByFieldOrderAtServer()
	
	ListAttribute = AutomaticDiscounts;
	
	UserOrderSettings = Undefined;
	For Each Item In ListAttribute.SettingsComposer.UserSettings.Items Do
		If TypeOf(Item) = Type("DataCompositionOrder") Then
			UserOrderSettings = Item;
			Break;
		EndIf;
	EndDo;
	
	CommonUseClientServer.Validate(UserOrderSettings <> Undefined, NStr("en = 'Custom order setup setting was not found.'"));
	
	UserOrderSettings.Items.Clear();
	Item = UserOrderSettings.Items.Add(Type("DataCompositionOrderItem"));
	Item.Use = True;
	Item.Field = New DataCompositionField("AdditionalOrderingAttribute");
	Item.OrderType = DataCompositionSortDirection.Asc;
	
EndProcedure

#EndRegion

#Region ProceduresFormEventsHandlers

// Procedure - OnCreateAtServer form event handler.
//
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	// Price accessibility setup for editing.
	AllowedEditDocumentPrices = DriveAccessManagementReUse.AllowedEditDocumentPrices();
	
	Items.DiscountTypes.ReadOnly = Not AllowedEditDocumentPrices;
	Items.AutomaticDiscounts.ReadOnly = Not AllowedEditDocumentPrices;
	
	// AutomaticDiscounts
	UseAutomaticDiscounts = GetFunctionalOption("UseAutomaticDiscounts");
	If UseAutomaticDiscounts Then
		Exclusion = PredefinedValue("Enum.DiscountsApplyingRules.Exclusion");
		Multiplication = PredefinedValue("Enum.DiscountsApplyingRules.Multiplication");
		
		SharedUsageVariantOfDiscounts = Constants.DefaultDiscountsApplyingRule.Get();
		If SharedUsageVariantOfDiscounts.IsEmpty() Then
			If AllowedEditDocumentPrices Then
				SharedUsageVariantOfDiscounts = Enums.DiscountsApplyingRules.Addition;
				SetPrivilegedMode(True);
				Constants.DefaultDiscountsApplyingRule.Set(SharedUsageVariantOfDiscounts);
				SetPrivilegedMode(False);
			Else
				Cancel = True;
				CommonUseClientServer.MessageToUser("Automatic discounts are not configured! Refer to the user with the right to edit price in the documents!");
				Return;
			EndIf;
		EndIf;
	EndIf;
	
	If Not AllowedEditDocumentPrices Then
		Items.SharedUsageVariantOfDiscounts.Visible = False;
		
		Items.LabelJointUseVariant.Title = "Joint application: "+Constants.DefaultDiscountsApplyingRule.Get();
		Items.LabelJointUseVariant.Visible = True;
	EndIf;
	// End AutomaticDiscounts
	
	VisibleManagementServer();
	
	If SharedUsageVariantOfDiscounts = Exclusion
		OR SharedUsageVariantOfDiscounts = Multiplication Then
		SetListSortingByFieldOrderAtServer();
	EndIf;
	
	// StandardSubsystems.AdditionalReportsAndDataProcessors
	AdditionalReportsAndDataProcessors.OnCreateAtServer(ThisForm, "ListForm");
	// End StandardSubsystems.AdditionalReportsAndDataProcessors
	
EndProcedure

// Procedure - event handler of the form NotificationProcessing.
//
&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
	If Source = "UseAutomaticDiscounts" Or Source = "UseManualDiscounts" Then
		VisibleManagementServer();
	EndIf;
	
EndProcedure

#EndRegion

#Region ProceduresAndFunctionsForFormAppearanceManagement

// The procedure manages the visible and headers depending on FO UseManualDiscounts and UseAutomaticDiscounts.
// 
&AtServer
Procedure VisibleManagementServer()
	
	UseAutomaticDiscounts = GetFunctionalOption("UseAutomaticDiscounts");
	UseManualDiscounts = GetFunctionalOption("UseManualDiscounts");
	If UseAutomaticDiscounts AND Not UseManualDiscounts Then
		Items.GroupManualDiscounts.Visible = False;
		Items.GroupManualAndAutomaticDiscounts.PagesRepresentation = FormPagesRepresentation.None;
		Title = NStr("en = 'Automatic discount'");
	ElsIf Not UseAutomaticDiscounts AND UseManualDiscounts Then
		Items.GroupAutomaticDiscounts.Visible = False;
		Items.GroupManualAndAutomaticDiscounts.PagesRepresentation = FormPagesRepresentation.None;
		Title = NStr("en = 'Discount types'");
	Else
		// This branch will be used while processing alerts of accounting setting forms.
		Items.GroupManualDiscounts.Visible = True;
		Items.GroupAutomaticDiscounts.Visible = True;
		Items.GroupManualAndAutomaticDiscounts.PagesRepresentation = FormPagesRepresentation.TabsOnTop;
		Title = NStr("en = 'Discounts'");
	EndIf;
	
EndProcedure
	
#EndRegion

#Region ProceduresElementFormEventsHandlers

// Procedure - event handler OnChange item DiscountSharedUsageVariant of the form.
//
&AtClient
Procedure SharedUsageVariantOfDiscountsOnChange(Item)
	
	DiscountsJointApplicationOptionOnChangeAtServer(SharedUsageVariantOfDiscounts);
	If SharedUsageVariantOfDiscounts = Exclusion
		OR SharedUsageVariantOfDiscounts = Multiplication Then
		ValidateListFilter();
	EndIf;
	Items.AutomaticDiscounts.Refresh();
	
EndProcedure

// Server part of DiscountSharedUsageVariantOnChange procedure.
//
&AtServerNoContext
Procedure DiscountsJointApplicationOptionOnChangeAtServer(SharedUsageVariantOfDiscounts)
	
	SetPrivilegedMode(True);
	Constants.DefaultDiscountsApplyingRule.Set(SharedUsageVariantOfDiscounts);
	SetPrivilegedMode(False);
	
EndProcedure

#EndRegion

#Region FormCommandsHandlers

// Procedure - CreateJointApplicationGroup command handler of the form.
&AtClient
Procedure CreateFolderSharedUse(Command)
	
	GroupFormParameters = New Structure("IsFolder", True);
	OpenForm("Catalog.AutomaticDiscountTypes.FolderForm", GroupFormParameters);
	
EndProcedure

// Procedure - SelectFlagActive command handler of the form.
//
&AtClient
Procedure EnableFlagActive(Command)
	
	If ValueIsFilled(Items.AutomaticDiscounts.SelectedRows) Then
		ChangeCheckBoxActsServer(True, Items.AutomaticDiscounts.SelectedRows);
	EndIf;
	
EndProcedure

// Procedure - ClearFlagActive command handler of the form.
//
&AtClient
Procedure ClearFlagActs(Command)
	
	If ValueIsFilled(Items.AutomaticDiscounts.SelectedRows) Then
		ChangeCheckBoxActsServer(False, Items.AutomaticDiscounts.SelectedRows);
	EndIf;
	
EndProcedure

#EndRegion

#Region ProceduresEventHandlersDynamicLists

// Procedure - OnChange event handler of AutomaticDiscounts dynamic list.
//
&AtClient
Procedure AutomaticDiscountsOnChange(Item)
	
	Item.Refresh();
	
EndProcedure

#EndRegion
